In [1]:
import os
import numpy
import json
import csv
import pandas as pd
import pymongo
from sqlalchemy import create_engine

In [2]:
host_name = "localhost"
host_ip = "127.0.0.1"
port = "3306"
user_id = "root"
pwd = "Ravenclaw_2728"

ports = {"mongo" : 27017, "mysql" : 3306}

atlas_cluster_name = "ds-midterm"
atlas_default_dbname = "admin"
atlas_user_name = "abg5eqp"
atlas_password = "Ravenclaw_2728"

conn_str = {"local" : f"mongodb://{host_name}:{ports['mongo']}/",
    "atlas" : f"mongodb+srv://{atlas_user_name}:{atlas_password}@{atlas_cluster_name}.rho0qln.mongodb.net/test?authSource={atlas_default_dbname}"
}


print(conn_str["local"])
print(conn_str["atlas"])

src_dbname = "movies"
dst_dbname = "movies_dw"

mongodb://localhost:27017/
mongodb+srv://abg5eqp:Ravenclaw_2728@ds-midterm.rho0qln.mongodb.net/test?authSource=admin

In [3]:
def get_sql_dataframe(user_id, pwd, host_name, db_name, sql_query):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, connection);
    connection.close()
    
    return dframe

def get_mongo_dataframe(connect_str, db_name, collection, query):
    '''Create a connection to MongoDB'''
    client = pymongo.MongoClient(connect_str)
    
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    return dframe


def get_mongo_dataframe_local(user_id, pwd, host_name, port, db_name, collection, query):
    '''Create a connection to MongoDB, with or without authentication credentials'''
    if user_id and pwd:
        mongo_uri = 'mongodb://%s:%s@%s:%s/%s' % (username, password, host, port, db_name)
        client = pymongo.MongoClient(mongo_uri)
    else:
        conn_str = f"mongodb://{host_name}:{port}/"
        client = pymongo.MongoClient(conn_str)
    
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    
    return dframe


def set_dataframe(user_id, pwd, host_name, db_name, df, table_name, pk_column, db_operation):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

In [4]:
conn_str1 = f"mysql+pymysql://{user_id}:{pwd}@{host_name}"
sqlEngine = create_engine(conn_str1, pool_recycle=3600)

sqlEngine.execute(f"DROP DATABASE IF EXISTS `{dst_dbname}`;")
sqlEngine.execute(f"CREATE DATABASE `{dst_dbname}`;")
sqlEngine.execute(f"USE {dst_dbname};")

In [5]:
sql_prod = "SELECT * FROM movies.production_company;"
df_prod = get_sql_dataframe(user_id, pwd, host_name, src_dbname, sql_prod)
df_prod.head(10)

   company_id             company_name
0           1                Lucasfilm
1           2     Walt Disney Pictures
2           3  Pixar Animation Studios
3           4       Paramount Pictures
4           5        Columbia Pictures
5           6       RKO Radio Pictures
6           7               DreamWorks
7           8       Fine Line Features
8           9                  Gaumont
9          11            WingNut Films

In [6]:
sql_mov = "SELECT * FROM movies.movie;"
df_mov = get_sql_dataframe(user_id, pwd, host_name, src_dbname, sql_mov)
df_mov.head(10)

,movie_id,title,budget,homepage,overview,popularity,release_date,revenue,runtime,movie_status,tagline,vote_average,vote_count
0,5,Four Rooms,4000000,,It's Ted the Bellhop's first night on the job....,22.876230,1995-12-09,4300000,98,Released,Twelve outrageous guests. Four scandalous requ...,6.5,530
1,11,Star Wars,11000000,http://www.starwars.com/films/star-wars-episod...,Princess Leia is captured and held hostage by ...,126.393695,1977-05-25,775398007,121,Released,"A long time ago in a galaxy far, far away...",8.1,6624
2,12,Finding Nemo,94000000,http://movies.disney.com/finding-nemo,"Nemo, an adventurous young clownfish, is unexp...",85.688789,2003-05-30,940335536,100,Released,"There are 3.7 trillion fish in the ocean, they...",7.6,6122
3,13,Forrest Gump,55000000,,A man with a low IQ has accomplished great thi...,138.133331,1994-07-06,677945399,142,Released,"The world will never be the same, once you've ...",8.2,7927
4,14,American Beauty,15000000,http://www.dreamworks.com/ab/,"Lester Burnham, a depressed suburban father in...",80.878605,1999-09-15,356296601,122,Released,Look closer.,7.9,3313
5,16,Dancer in the Dark,12800000,,"Selma, a Czech immigrant on the verge of blind...",22.022228,2000-05-17,40031879,140,Released,You don't need eyes to see.,7.6,377
6,18,The Fifth Element,90000000,,"In 2257, a taxi driver is unintentionally give...",109.528572,1997-05-07,263920180,126,Released,There is no future without it.,7.3,3885
7,19,Metropolis,92620000,,In a futuristic city sharply divided between t...,32.351527,1927-01-10,650422,153,Released,There can be no understanding between the hand...,8.0,657
8,20,My Life Without Me,0,http://www.clubcultura.com/clubcine/clubcineas...,A Pedro Almodovar production in which a fatall...,7.958831,2003-03-07,9726954,106,Released,,7.2,77
9,22,Pirates of the Caribbean: The Curse of the Bla...,140000000,http://disney.go.com/disneyvideos/liveaction/p...,"Jack Sparrow, a freewheeling 17th-century pira...",271.972889,2003-07-09,655011224,143,Released,Prepare to be blown out of the water.,7.5,6985

In [7]:
#with open('movie_company.json') as f:
   #data = json.load(f)
#print(data)
df_comp = pd.read_json('movie_company.json')
df_comp.insert(0, "movie_company_key", range(1, df_comp.shape[0] + 1))
df_comp.head(10)

   movie_company_key  movie_id  company_id
0                  1         5          14
1                  2         5          59
2                  3        11           1
3                  4        11         306
4                  5        12           3
5                  6        13           4
6                  7        14          27
7                  8        14        2721
8                  9        16       11239
9                 10        16         119

In [8]:
client = pymongo.MongoClient(conn_str["atlas"])
db = client[src_dbname]
data_dir = os.path.join(os.getcwd())

df_dict = []
csv_files = {"movie_cast" : 'movie_cast.csv'}
df_dict = []

for file in csv_files:
    c_file = os.path.join(data_dir, csv_files[file])
    with open(c_file,  encoding= "utf8") as openfile:
        reader = csv.DictReader(openfile)
        list_reader = list(reader)
        file = db[file]
        result = file.insert_many(list_reader)
client.close()

In [9]:
query = {}
collection = "movie_cast"

df_movie_cast = get_mongo_dataframe(conn_str['atlas'], src_dbname, collection, query)
df_movie_cast.head(2)

  movie_id person_id        character_name gender_id cast_order
0      285        85  Captain Jack Sparrow         2          0
1      285       114           Will Turner         2          1

In [10]:
# Dropping Columns 
drop_cols = ['cast_order']
df_movie_cast.drop(drop_cols, axis=1, inplace=True)
df_movie_cast.insert(0, "movie_cast_key", range(1, df_movie_cast.shape[0] + 1))

df_movie_cast.head(2)

   movie_cast_key movie_id person_id        character_name gender_id
0               1      285        85  Captain Jack Sparrow         2
1               2      285       114           Will Turner         2

In [11]:
# Dropping Columns 
drop_cols = ['homepage', 'overview', 'tagline']
df_mov.drop(drop_cols, axis=1, inplace=True)
df_mov.rename(columns={"movie_id":"movie_key"}, inplace=True)

df_mov.head(2)

,movie_key,title,budget,popularity,release_date,revenue,runtime,movie_status,vote_average,vote_count
0,5,Four Rooms,4000000,22.876230,1995-12-09,4300000,98,Released,6.5,530
1,11,Star Wars,11000000,126.393695,1977-05-25,775398007,121,Released,8.1,6624

In [12]:
# Add keys
df_prod.rename(columns={"company_id":"production_company_key"}, inplace=True)

In [13]:
db_operation = "insert"

tables = [('dim_movie', df_mov, 'movie_key'),
          ('dim_production_company', df_prod, 'production_company_key'),
          ('dim_movie_company', df_comp, 'movie_company_key'),
          ('dim_movie_cast', df_movie_cast, 'movie_cast_key')]

In [14]:
for table_name, dataframe, primary_key in tables:
    set_dataframe(user_id, pwd, host_name, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [19]:
sql_fact_orders = """SELECT m.movie_id as movie_key,
mc.company_id,
m.title,
m.budget,
m.popularity,
m.release_date,
m.revenue,
m.runtime,
m.movie_status,
m.vote_average,
m.vote_count
FROM movie m JOIN movie_company mc ON m.movie_id = mc.movie_id JOIN production_company p ON mc.company_id = p.company_id GROUP BY m.movie_id HAVING count(*) = 1
"""
df_fact_orders = get_sql_dataframe(user_id, pwd, host_name, src_dbname, sql_fact_orders)
df_fact_orders.head(10)

,movie_key,company_id,title,budget,popularity,release_date,revenue,runtime,movie_status,vote_average,vote_count
0,1893,1,Star Wars: Episode I - The Phantom Menace,115000000,54.035265,1999-05-19,924317558,136,Released,6.3,4432
1,1894,1,Star Wars: Episode II - Attack of the Clones,120000000,43.987061,2002-05-15,649398328,142,Released,6.4,3992
2,1895,1,Star Wars: Episode III - Revenge of the Sith,113000000,44.108427,2005-05-17,850000000,140,Released,7.1,4116
3,756,2,Fantasia,2280000,32.875469,1940-11-13,83320000,124,Released,7.2,808
4,812,2,Aladdin,28000000,92.982009,1992-11-25,504050219,90,Released,7.4,3416
5,4244,2,The Kid,65000000,18.281798,2000-07-07,69700000,104,Released,6.0,238
6,9849,2,My Favorite Martian,65000000,6.806920,1999-02-11,36850101,94,Released,5.1,80
7,9918,2,Glory Road,0,8.305085,2006-01-13,42647449,118,Released,7.2,144
8,10439,2,Hocus Pocus,28000000,18.650748,1993-07-16,39514713,96,Released,6.4,471
9,10545,2,The Hunchback of Notre Dame,100000000,46.727941,1996-06-21,100138851,91,Released,6.8,1129

In [20]:
table_name = "fact_orders"
primary_key = "movie_key"
db_operation = "insert"

set_dataframe(user_id, pwd, host_name, dst_dbname, df_fact_orders, table_name, primary_key, db_operation)